### Pandas library

In [2]:
import pandas as pd

In [3]:
#series
data = [1,2,3,4,5]
s = pd.Series(data)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#create a series from dictionary elements
data = {'a':0., 'b':1., 'c':2.}
s = pd.Series(data)
print(s)
print(type(s))

a    0.0
b    1.0
c    2.0
dtype: float64
<class 'pandas.core.series.Series'>

In [5]:
data=[10,20,30]
indexes=['a','b','c']
s=pd.Series(data,indexes)
print(s)

a    10
b    20
c    30
dtype: int64

In [6]:
#dataframe
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
#dataframe using dictionary
data= {
    'name': ['krish','john','dev'],
    'age': [25,26,27],
    'city': ['mumbai','delhi','bangalore']
     }
df = pd.DataFrame(data)
print(df)
print(type(df))

    name  age       city
0  krish   25     mumbai
1   john   26      delhi
2    dev   27  bangalore
<class 'pandas.core.frame.DataFrame'>

In [8]:
#create a datframe from list of dictionary
data=[
        {'Name':'krish','Age':25},
        {'Name':'john','Age':26},
        {'Name':'dev','Age':27}
        
    ]
df=pd.DataFrame(data)
print(df)

    Name  Age
0  krish   25
1   john   26
2    dev   27

In [9]:
data=pd.read_csv('data.csv')
print(data.head())

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [10]:
#Accessing data from dataframe
data=[
        {'Name':'krish','Age':25 , 'city':'mumbai'},
        {'Name':'john','Age':26, 'city':'delhi'},
        {'Name':'dev','Age':27, 'city':'bangalore'}
        
    ]
df=pd.DataFrame(data)
print(df)
print(df['Name'])
##print(df)
print("loc",df.loc[0])
print()
print("iloc",df.iloc[0])

    Name  Age       city
0  krish   25     mumbai
1   john   26      delhi
2    dev   27  bangalore
0    krish
1     john
2      dev
Name: Name, dtype: object
loc Name     krish
Age         25
city    mumbai
Name: 0, dtype: object

iloc Name     krish
Age         25
city    mumbai
Name: 0, dtype: object

In [11]:


df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

# Select rows where index is 0 and 1, and columns 'A' and 'B' labels
# Does include the end position in slicing 

print(df.loc[0:1, ['A', 'B']])

   A  B
0  1  4
1  2  5

In [12]:


df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

# Select rows at positions 0 and 1, and columns at positions 0 and 1 indexing
# Does not include the end position in slicing
print(df.iloc[0:2, 0:2])

   A  B
0  1  4
1  2  5

In [13]:
#Accessing secific element
data=[
        {'Name':'krish','Age':25 , 'city':'mumbai'},
        {'Name':'john','Age':26, 'city':'delhi'},
        {'Name':'dev','Age':27, 'city':'bangalore'}
        
    ]
df=pd.DataFrame(data)
print(df)
df.at[0,'Name']
df.at[2,'city']

    Name  Age       city
0  krish   25     mumbai
1   john   26      delhi
2    dev   27  bangalore

'bangalore'

In [14]:
df.iat[0,2]

'mumbai'

In [15]:
#Data Mnipulation in dataframe
df['salary']=[5000,6000,7000]
df  #add a new column to dataframe

    Name  Age       city  salary
0  krish   25     mumbai    5000
1   john   26      delhi    6000
2    dev   27  bangalore    7000

In [16]:
df.drop('salary',axis=1, inplace=True)

In [17]:
df

    Name  Age       city
0  krish   25     mumbai
1   john   26      delhi
2    dev   27  bangalore

In [18]:
df['Age']=df['Age']+5
df

    Name  Age       city
0  krish   30     mumbai
1   john   31      delhi
2    dev   32  bangalore

In [19]:
df.drop(2 , inplace=True)

In [20]:
df.describe()

             Age
count   2.000000
mean   30.500000
std     0.707107
min    30.000000
25%    30.250000
50%    30.500000
75%    30.750000
max    31.000000

In [21]:
df

    Name  Age    city
0  krish   30  mumbai
1   john   31   delhi